; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v8 ?v6)
		(pred_2 ?v3)
		(pred_4 ?v7)
		(pred_1 ?v7)
		(pred_3 ?v3 ?v7)
		(pred_5)
		(pred_6 ?v3))

   (:action op_3
       :parameters  (?v1 ?v5)
       :precondition (and (not-eq ?v1 ?v5) 
                          (pred_4 ?v1) (pred_4 ?v5) (pred_1 ?v1))
       :effect (and  (pred_1 ?v5)
		     (not (pred_1 ?v1))))


   (:action op_1
       :parameters (?v2 ?v4)
       :precondition  (and  (pred_2 ?v2) (pred_4 ?v4)
			    (pred_3 ?v2 ?v4) (pred_1 ?v4) (pred_5))
       :effect (and (pred_6 ?v2)
		    (not (pred_3 ?v2 ?v4)) 
		    (not (pred_5))))

   (:action op_2
       :parameters  (?v2  ?v4)
       :precondition  (and  (pred_2 ?v2) (pred_4 ?v4)
			    (pred_6 ?v2) (pred_1 ?v4))
       :effect (and (pred_3 ?v2 ?v4)
		    (pred_5)
		    (not (pred_6 ?v2)))))

; problem
(define (problem ferry-l5-c2)
(:domain ferry)
(:objects obj_03 obj_05 obj_06 obj_07 obj_04 
          obj_02 obj_01 
)
(:init
(pred_4 obj_03)
(pred_4 obj_05)
(pred_4 obj_06)
(pred_4 obj_07)
(pred_4 obj_04)
(pred_2 obj_02)
(pred_2 obj_01)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(pred_5)
(pred_3 obj_02 obj_04)
(pred_3 obj_01 obj_07)
(pred_1 obj_06)
)
(:goal
(and
(pred_3 obj_02 obj_03)
(pred_3 obj_01 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_3 obj_02 obj_03) (pred_1 obj_05))
    (sometime-before  (pred_3 obj_01 obj_04) (pred_1 obj_03))
  )
)
)

; plan
1. (op_3 obj_06 obj_07)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_07)
   goals met: 0 of 2
2. (op_1 obj_01 obj_07)
   deleted: (pred_3 obj_01 obj_07) (pred_5)
   added: (pred_6 obj_01)
   goals met: 0 of 2
3. (op_3 obj_07 obj_05)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_05)
   goals met: 0 of 2
4. (op_2 obj_01 obj_05)
   deleted: (pred_6 obj_01)
   added: (pred_3 obj_01 obj_05) (pred_5)
   goals met: 0 of 2
5. (op_3 obj_05 obj_04)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_04)
   goals met: 0 of 2
6. (op_1 obj_02 obj_04)
   deleted: (pred_3 obj_02 obj_04) (pred_5)
   added: (pred_6 obj_02)
   goals met: 0 of 2
7. (op_3 obj_04 obj_03)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_03)
   goals met: 0 of 2
8. (op_2 obj_02 obj_03)
   deleted: (pred_6 obj_02)
   added: (pred_3 obj_02 obj_03) (pred_5)
   goals met: 1 of 2
9. (op_3 obj_03 obj_05)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_05)
   goals met: 1 of 2
10. (op_1 obj_01 obj_05)
   deleted: (pred_3 obj_01 obj_05) (pred_5)
   added: (pred_6 obj_01)
   goals met: 1 of 2
11. (op_3 obj_05 obj_04)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_04)
   goals met: 1 of 2
12. (op_2 obj_01 obj_04)
   deleted: (pred_6 obj_01)
   added: (pred_3 obj_01 obj_04) (pred_5)
   goals met: 2 of 2
